it/src/Documents/СписаниеОС/СписаниеОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеОС</name>
  <registerRecords>AccumulationRegister.РазмещениеЛицензий</registerRecords>
  <registerRecords>AccumulationRegister.РазмещениеОбъектов</registerRecords>
  <registerRecords>InformationRegister.СписаныеОС</registerRecords>
  <registerRecords>AccumulationRegister.ЛицензииОрганизации</registerRecords>
  <registerRecords>InformationRegister.ОтключенныеКомпьютеры</registerRecords>
  <registerRecords>InformationRegister.МестонахождениеОС</registerRecords>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

it/src/Documents/СписаниеОС/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗАПОЛНЕНИЯ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура формирует структуру шапки документа и дополнительных полей.
//
Процедура ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, РежимПроведения = Неопределено) Экспорт
	
	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначенияСервер.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначенияСервер.СформироватьДеревоПолейЗапросаПоШапке();
	//ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ОсновноеСредство", "НаименованиеПолное",   "НаименованиеПолное");
	
	СтруктураШапкиДокумента = ОбщегоНазначенияСервер.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияСервер.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
КонецПроцедуры // ПодготовитьСтруктуруШапкиДокумента() 

// Процедура формирует таблицы документа.
//
Процедура ПодготовитьТаблицыДокумента() Экспорт
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРазмещениеОбъектов", Документы.СписаниеОС.ПолучитьТаблицуРазмещенияОбъектов(ДополнительныеСвойства));
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРаспределениеЛицензий", Документы.СписаниеОС.ПолучитьТаблицуРаспределениеЛицензий(ДополнительныеСвойства));
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЛицензииОрганизации", Документы.СписаниеОС.ПолучитьТаблицуЛицензииОрганизации(ДополнительныеСвойства));
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаМестонахождениеОС", Документы.СписаниеОС.ПолучитьТаблицуМестонахождениеОС(ДополнительныеСвойства));
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтключенныеКомпьютеры", Документы.СписаниеОС.ПолучитьТаблицуОтключенныеКомпьютеры(ДополнительныеСвойства));
	
	////СтруктураШапкиДокумента.ТаблицыДляДвижений.Вставить("ТаблицаСписанныхОС", Документы.СписаниеОС.ПолучитьТаблицуТаблицаСписанныхОС(СтруктураШапкиДокумента));
	
КонецПроцедуры // ПодготовитьТаблицыДокумента()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары,
//  ТаблицаПоСкидкам          - таблица значений, содержащая данные для проведения и проверки ТЧ Скидки,
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  ТаблицаПоУслугам          - таблица значений, содержащая данные для проведения и проверки ТЧ "Услуги",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	ОтражениеПоРегистрамСервер.ОтразитьРазмещениеОбъектов(ДополнительныеСвойства, Движения, Отказ);
	ОтражениеПоРегистрамСервер.ОтразитьЛицензииОрганизации(ДополнительныеСвойства, Движения, Отказ);
	ОтражениеПоРегистрамСервер.ОтразитьРаспределенияЛицензий(ДополнительныеСвойства, Движения, Отказ);
	
	ОтражениеПоРегистрамСервер.ОтразитьМестонахождениеОС(ДополнительныеСвойства, Движения, Отказ);
	ОтражениеПоРегистрамСервер.ОтразитьОтключенныеКомпьютеры(ДополнительныеСвойства, Движения, Отказ);
	////ОтражениеПоРегистрамСервер.ОтразитьСписаниеОС(СтруктураШапкиДокумента.ТаблицыДляДвижений.ТаблицаСписанныхОС, СтруктураШапкиДокумента, Движения, Отказ);
	
КонецПроцедуры // ДвиженияПоРегистрам()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
    Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
    
		Возврат;
		
	КонецЕсли;

КонецПроцедуры

// Функция формирует временные данных документа.
//
// Возвращаемое значение:
//	МенеджерВременныхТаблиц - менеджер временных таблиц
//
Функция ВременныеТаблицыДанныхДокумента() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СписаниеОСОсновныеСредства.ОсновноеСредство
	               |ПОМЕСТИТЬ втТаблицаОсновныеСредства
	               |ИЗ
	               |	Документ.СписаниеОС.ОсновныеСредства КАК СписаниеОСОсновныеСредства
	               |ГДЕ
	               |	СписаниеОСОсновныеСредства.Ссылка = &Ссылка";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапрос = Запрос.Выполнить();
	
	Возврат МенеджерВременныхТаблиц;
	
КонецФункции // ВременныеТаблицыДанныхДокумента()


// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ЗаполнитьВременныеТаблицы(Отказ)

	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерВременныхТаблиц = ВременныеТаблицыДанныхДокумента();

КонецПроцедуры // ЗаполнитьВременныеТаблицы()

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОтражениеПоРегистрамСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ЗаполнитьВременныеТаблицы(Отказ);
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры


Процедура СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;
	// Контроль выполняется при проведении\отмене проведения не нового документа.

	Если ДополнительныеСвойства.ДляПроведения.РежимПроведения = РежимПроведенияДокумента.Оперативный
		И ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Массив.Добавить(Движения.РазмещениеЛицензий);
		Массив.Добавить(Движения.ЛицензииОрганизации);
		Массив.Добавить(Движения.РазмещениеОбъектов);
	КонецЕсли;

	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры // СформироватьСписокРегистровДляКонтроля()


// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем Заголовок, СтруктураШапкиДокумента;
	Перем ТаблицаПроверки;
	
	// Подготовим структуру шапки документа
	//ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, РежимПроведения);
	
	ОтражениеПоРегистрамСервер.ДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	ОтражениеПоРегистрамСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ПодготовитьТаблицыДокумента();
	
	//ЗаполнениеДокументовСервер.ПроверитьДублиТабличнойЧасти(СтруктураШапкиДокумента, Отказ, Заголовок, "ОсновноеСредство","ОсновныеСредства");
	
	//УправлениеОсновнымиСредствамиСервер.СуществованиеДвиженийМестонахождениеОС("ОсновныеСредства", СтруктураШапкиДокумента, Отказ, Заголовок, ЭтотОбъект, Истина);	
	
	Если Не Отказ Тогда
		
		ДвиженияПоРегистрам(РежимПроведения, ДополнительныеСвойства, Отказ, Заголовок);
		
		СформироватьСписокРегистровДляКонтроля();
		
		ОтражениеПоРегистрамСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		ОтражениеПоРегистрамСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
		
		ОтражениеПоРегистрамСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
		
	КонецЕсли;
	
КонецПроцедуры
